In [78]:
import pandas as pd
import math

from sklearn.preprocessing import LabelEncoder
from sklearn import tree

In [79]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [80]:
inputs = df.drop(['Survived','PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis='columns')
target = df['Survived']

In [81]:
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [82]:
sex_le = LabelEncoder()
inputs['sex_n'] = sex_le.fit_transform(inputs['Sex'])

In [83]:
inputs_n = inputs.drop('Sex', axis='columns')

In [84]:
inputs_n.head()

   Pclass   Age     Fare  sex_n
0       3  22.0   7.2500      1
1       1  38.0  71.2833      0
2       3  26.0   7.9250      0
3       1  35.0  53.1000      0
4       3  35.0   8.0500      1

In [85]:
inputs_n = inputs_n.fillna(math.floor(inputs_n['Age'].median()))

In [86]:
model = tree.DecisionTreeClassifier()

In [87]:
model.fit(inputs_n, target)

DecisionTreeClassifier()

In [88]:
model.predict([[1,30,55.5,0]])

array([1], dtype=int64)

In [89]:
model.score(inputs_n, target)

0.9775533108866442